Autodesk.Revit.DB.DefinitionBindingMapIterator
An iterator to a parameter definition to parameter bindings map.

Autodesk.Revit.DB.DefinitionBindingMapIterator.Key
Autodesk::Revit::Parameters::Definition
get
Retrieves the definition that is the current focus of the iterator.
Remarks:
A new or Reset iterator must have MoveNext called on it before Current will return a valid
key as per expected behavior of IEnumerator.

Autodesk.Revit.DB.DefinitionBindingMapIterator.Current
System.Object
get
Retrieves the binding that is the current focus of the iterator.
Remarks:
A new or Reset iterator must have MoveNext called on it before Current will return a valid
item as per expected behavior of IEnumerator.

Autodesk.Revit.DB.DefinitionBindingMapIterator.MoveNext
System.Boolean
Move the iterator one item forward.
Returns:
Returns True if the iterator was successfully moved forward one item and the Current
property will return a valid item. False will be returned it the iterator has reached the end of
the map.
Remarks:
MoveNext must be called before the Current property is valid with a new or Reset iterator
in line with the expected behavior of IEnumerator.

Autodesk.Revit.DB.DefinitionBindingMapIterator.Reset
void
Bring the iterator back to the start of the map.
Remarks: The Reset method will return the iterator back to the start of the map in line with the definition of IEnumerator. Note that you must call MoveNext before the first item can be accessed via the Current property.

Autodesk.Revit.DB.DefinitionBindingMapIterator.#ctor
void
For Internal Use Only.
Remarks: This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.